In [8]:
import pandas as pd

#read data from excel files into pandas dataframes
lecturer_df = pd.read_excel('Lecturer.xlsx')
student_df = pd.read_excel('Student.xlsx')
course_df = pd.read_excel('Course.xlsx')
enroll_df = pd.read_excel('Enroll.xlsx')
teaching_df = pd.read_excel('Teaching.xlsx')

lecturer_df

   LecturerID              LecturerName  Age  Gender                Unit
0         301         Dr. Harry Clinton   38  Female                  IT
1         302  Prof. Dr. Marek Reformat   56    Male                  IT
2         303               Vince Davis   60    Male                  IT
3         402             Matthew Scott   28    Male         Mathematics
4         403         Prof. Runjuan Liu   33  Female  Business Economics

In [9]:
co1203_students = student_df[student_df['Group'] == 'CO1203']
print("students who belong to group 'co1203' : ")
print(co1203_students)

students who belong to group 'co1203' :
    StudentID   Group      StudentName
0  23D1080041  CO1203  Nguyễn Duy Vinh
1  23D1150001  CO1203   Lại Trọng Bách
2  23D1150002  CO1203    Nguyễn Duy Đô
3  23D1150004  CO1203  Trần Ngọc Thành
4  23D1150005  CO1203     Trần Văn Trà
5  23D1150006  CO1203    Vũ Thanh Tùng

In [11]:
co1205_students = student_df[student_df['Group'].isin(['CO1203','CO1205'])]
print("\nstudents who belong to group 'co1203' and 'co1205' : ")
print(co1205_students)

students who belong to group 'co1203' and 'co1205' :
     StudentID   Group      StudentName
0   23D1080041  CO1203  Nguyễn Duy Vinh
1   23D1150001  CO1203   Lại Trọng Bách
2   23D1150002  CO1203    Nguyễn Duy Đô
3   23D1150004  CO1203  Trần Ngọc Thành
4   23D1150005  CO1203     Trần Văn Trà
5   23D1150006  CO1203    Vũ Thanh Tùng
6   23D1050001  CO1205    Hoàng Văn Đạt
7   23D1050002  CO1205    Trần Văn Ngọc
8   23D1050003  CO1205   Trần Văn Quyền
9   23D1050004  CO1205   Bùi Tuấn Thuận
10  23D1050005  CO1205    Trịnh Đình Tú
11  23D1050006  CO1205    Lê Quang Khải
12  23D1050007  CO1205   Đinh Nam Dương

In [26]:
math1179_students = set(enroll_df[enroll_df['CourseID'] == 'MATH1179']['StudentID'])
comp1589_students = set(enroll_df[enroll_df['CourseID'] == 'COMP1589']['StudentID'])
enroll = math1179_students.union(comp1589_students)
enroll_students = student_df[student_df['StudentID'].isin(enroll)]
print(enroll_students)

     StudentID   Group      StudentName
5   23D1150006  CO1203    Vũ Thanh Tùng
6   23D1050001  CO1205    Hoàng Văn Đạt
7   23D1050002  CO1205    Trần Văn Ngọc
8   23D1050003  CO1205   Trần Văn Quyền
9   23D1050004  CO1205   Bùi Tuấn Thuận
10  23D1050005  CO1205    Trịnh Đình Tú
11  23D1050006  CO1205    Lê Quang Khải
12  23D1050007  CO1205   Đinh Nam Dương
13  21L1080021  CO1204  Nguyễn Huy Hùng